models/mgcms/db/CategoryQuery.php

SELECT * FROM `category` WHERE (`type`='training') AND (NOT (`parent_id` IS NULL)) ORDER BY `id`
---
    public function all($db = null)
    {
        return parent::all($db);

SELECT * FROM `category` WHERE 0=1
---
    public function one($db = null)
    {
        return parent::one($db);