models/mgcms/db/User.php

  function getCredibilityCalc()
  {
    $creadibility = 0;
    if ($this->date_email_confirmation && $this->date_email_confirmation != '0000-00-00 00:00:00') {
      $creadibility += 40 * 0.25;
    }
    if ($this->position) {
      $creadibility += 40 * 0.125;
    }
    if ($this->getEducationalLevels()->count() > 0) {
---
SELECT * FROM `user_educational_level` WHERE `user_id`=1
SELECT COUNT(*) FROM `educational_level` WHERE 0=1

  public function getSubjectsStr()
  {
    return join(', ', array_map(function($x) {
          return $x->name;
        }, $this->getSubjects()->all()));
---
SELECT * FROM `user_subject` WHERE `user_id`=1280

    public static function findLectorAdnCoachUsers()
    {
        $query = User::find()->orderBy('id')->orderBy(['first_name' => SORT_ASC, 'username' => SORT_ASC]);
        $query->joinWith('roles');
        $query->andWhere(['in','role.slug', [self::ROLE_LECTOR, self::ROLE_COACH]]);
        return $query->all();
---
SELECT `user`.* FROM `user` LEFT JOIN `user_role` ON `user`.`id` = `user_role`.`user_id` LEFT JOIN `role` ON `user_role`.`role_id` = `role`.`id` WHERE (`user`.`is_deleted` <> 1) AND (`role`.`slug` IN ('wykladowca', 'trener')) ORDER BY `first_name`, `username`
SELECT * FROM `user_role` WHERE `user_id` IN (1328, 1423, 1449, 1229, 1448, 1453, 1454, 1468, 1465, 1466, 1447, 715, 1467)