models/db/EducationalLevelQuery.php

SELECT * FROM `educational_level` ORDER BY `id`
---
    public function all($db = null)
    {
        return parent::all($db);