models/db/RoleQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `role` WHERE 0=1