models/db/TrainingRequiredQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `training_required` WHERE `training_id`=69