models/db/TrainingTrainingDirectionQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `training_training_direction` WHERE `training_id`=69

    public function one($db = null)
    {
        return parent::one($db);
---
SELECT * FROM `training_training_direction` WHERE (`training_id`='69') AND (`training_direction_id`='1')