models/db/Training.php

  public static function getIncomingTrainings()
  {
    $query = self::find()
        ->andWhere(['visibility' => self::VISIBILITY_YES])
        ->andWhere(['>', 'date_start', new \yii\db\Expression('NOW()')]);

    return $query->all();
---
SELECT * FROM `training` WHERE (`training`.`is_deleted` <> 1) AND (`visibility`='Tak') AND (`date_start` > NOW())