models/db/TrainingLectorQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `training_lector` WHERE `training_id`=69