models/db/TrainingTemplateEducationalLevelQuery.php

SELECT * FROM `training_template_educational_level` WHERE `training_template_id`=21
---
    public function all($db = null)
    {
        return parent::all($db);