models/LoginForm.php

SELECT * FROM `user` WHERE (`user`.`is_deleted` <> 1) AND ((`username`='marcin') OR (`email`='marcin'))
---
  public function getUser()
  {
    if ($this->_user === false) {
      $this->_user = mgcms\db\User::find()->andWhere(['or', ['username' => $this->username], ['email' => $this->username]])->one();